In [1]:
import numpy as np
import pandas as pd

In [2]:
data = {'Company':['GOOGL','GOOGL','MSFT','MSFT','FB','FB'],
       'Person':['Sundar', 'Sergey','Satya','Bill','Mark','Sheryl'],
       'Sales':[200, 120,340,560,410,670]}

In [4]:
df = pd.DataFrame(data)

In [5]:
df

  Company  Person  Sales
0   GOOGL  Sundar    200
1   GOOGL  Sergey    120
2    MSFT   Satya    340
3    MSFT    Bill    560
4      FB    Mark    410
5      FB  Sheryl    670

In [6]:
companyGroup = df.groupby('Company')

In [7]:
companyGroup.mean()

         Sales
Company
FB         540
GOOGL      160
MSFT       450

In [8]:
companyGroup.sum()

         Sales
Company
FB        1080
GOOGL      320
MSFT       900

In [10]:
companyGroup.sum().loc['FB']

Sales    1080
Name: FB, dtype: int64

In [11]:
companyGroup.count()

         Person  Sales
Company
FB            2      2
GOOGL         2      2
MSFT          2      2

In [12]:
df.groupby('Company').min()

         Person  Sales
Company
FB         Mark    410
GOOGL    Sergey    120
MSFT       Bill    340

In [14]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min    25%    50%    75%    max
Company
FB        2.0  540.0  183.847763  410.0  475.0  540.0  605.0  670.0
GOOGL     2.0  160.0   56.568542  120.0  140.0  160.0  180.0  200.0
MSFT      2.0  450.0  155.563492  340.0  395.0  450.0  505.0  560.0

In [15]:
df

  Company  Person  Sales
0   GOOGL  Sundar    200
1   GOOGL  Sergey    120
2    MSFT   Satya    340
3    MSFT    Bill    560
4      FB    Mark    410
5      FB  Sheryl    670